---
kind: method
id: M:Autodesk.Revit.DB.Lighting.InitialFluxIntensity.#ctor(Autodesk.Revit.DB.Lighting.InitialFluxIntensity)
source: html/9aeb56a7-5754-bdb6-184e-654e0b512744.htm
---
# Autodesk.Revit.DB.Lighting.InitialFluxIntensity.#ctor Method

Creates a copy of the given initial flux intensity object

## Syntax (C#)
```csharp
public InitialFluxIntensity(
	InitialFluxIntensity other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Lighting.InitialFluxIntensity`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null